In [1]:
import pandas as pd

## 1.Series

Seriesの作り方

In [2]:
#基本的にseriesの作り方はarrayと変わらない。
obj = pd.Series([3,7,10,13])
obj

0     3
1     7
2    10
3    13
dtype: int64

In [3]:
#array → Series
import numpy as np
numpy_array = np.array([3,7,10,13])
pd.Series(numpy_array)

0     3
1     7
2    10
3    13
dtype: int32

In [4]:
#Seriesから情報を抽出
obj[1]

7

In [5]:
#Series → arrayときは、.valuesと続ける
obj.values

array([ 3,  7, 10, 13], dtype=int64)

In [6]:
#フィルタリング
#各要素が条件を満たすか否かをbool値で返す
obj >=5

0    False
1     True
2     True
3     True
dtype: bool

In [7]:
#条件を満たすものだけを抽出して、Seriesを作成
obj[obj>=5]

1     7
2    10
3    13
dtype: int64

## 2.DataFrame

In [8]:
df = pd.DataFrame({'名前': ['山田', '鈴木', '佐藤', '田中', '斎藤', '高橋'],
                   '年齢': [20, 34, 50, 12, 62, 22],
                   '性別': ['男', '男', '女', '男', '女', '女']})

df

   名前  年齢 性別
0  山田  20  男
1  鈴木  34  男
2  佐藤  50  女
3  田中  12  男
4  斎藤  62  女
5  高橋  22  女

In [9]:
#情報の抽出
#最初の5行だけ抽出
df.head()

   名前  年齢 性別
0  山田  20  男
1  鈴木  34  男
2  佐藤  50  女
3  田中  12  男
4  斎藤  62  女

In [10]:
df.head(3)

   名前  年齢 性別
0  山田  20  男
1  鈴木  34  男
2  佐藤  50  女

In [11]:
#最後の5行だけ抽出
df.tail()

   名前  年齢 性別
1  鈴木  34  男
2  佐藤  50  女
3  田中  12  男
4  斎藤  62  女
5  高橋  22  女

In [12]:
df.tail(3)

   名前  年齢 性別
3  田中  12  男
4  斎藤  62  女
5  高橋  22  女

In [13]:
#行の抽出→iloc[#]を使う
#勝手にSeriesに変換されてしまう
print(df.iloc[2])
print(type(df.iloc[2]))

名前    佐藤
年齢    50
性別     女
Name: 2, dtype: object
<class 'pandas.core.series.Series'>

In [14]:
#DataFrame型のまま抽出したいときは、[]を2重にする
df.iloc[[2]]

   名前  年齢 性別
2  佐藤  50  女

In [15]:
#列の抽出 →　loc
#行、列の順番で指定する必要があるため、行はスライシングですべて指定
#自動的にSeries型に変換されることに注意
df.loc[:,"年齢"]

0    20
1    34
2    50
3    12
4    62
5    22
Name: 年齢, dtype: int64

In [16]:
#やはり、2重括弧にすることでDataFrame型のまま抽出可能
df.loc[:,["年齢"]]

   年齢
0  20
1  34
2  50
3  12
4  62
5  22

In [17]:
df["年齢"]

0    20
1    34
2    50
3    12
4    62
5    22
Name: 年齢, dtype: int64

In [18]:
df[["年齢"]]

   年齢
0  20
1  34
2  50
3  12
4  62
5  22

In [19]:
#要素の抽出
#ilocメソッドで【行のindex, 列のindex】を順番に指定
df.iloc[1,0]

'鈴木'

In [34]:
#locメソッドで【行のindex, 列の名称】を順番に指定
df.loc[2,"年齢"]

50

## DataFrameの編集

In [21]:
#行の追加→axis=0
row = pd.DataFrame({'名前': ['渡邊'], '年齢': [45], '性別': ['男']})
df_2 = pd.concat([df, row], axis = 0)
df_2

   名前  年齢 性別
0  山田  20  男
1  鈴木  34  男
2  佐藤  50  女
3  田中  12  男
4  斎藤  62  女
5  高橋  22  女
0  渡邊  45  男

In [49]:
#indexを変更したい(渡邊を6にしたい)
print(len(df_2))
df_2.index = np.arange(len(df_2))
df_2

7

   名前  年齢 性別
0  山田  20  男
1  鈴木  34  男
2  佐藤  50  女
3  田中  12  男
4  斎藤  62  女
5  高橋  22  女
6  渡邊  45  男

In [25]:
#列の追加→axis = 1
df_2['居住地'] = ['東京','大阪','北海道','宮城','富山','大分', '沖縄']
df_2

   名前  年齢 性別  居住地
0  山田  20  男   東京
1  鈴木  34  男   大阪
2  佐藤  50  女  北海道
3  田中  12  男   宮城
4  斎藤  62  女   富山
5  高橋  22  女   大分
0  渡邊  45  男   沖縄

   名前  年齢 性別  居住地  居住地
0  山田  20  男   東京   東京
1  鈴木  34  男   大阪   大阪
2  佐藤  50  女  北海道  北海道
3  田中  12  男   宮城   宮城
4  斎藤  62  女   富山   富山
5  高橋  22  女   大分   大分
6  渡邊  45  男   沖縄   沖縄

In [28]:
#行の削除→.dropメソッド(axis=0)
df_3 = df_2.drop(2, axis = 0)
df_3.index = np.arange(len(df_3))
df_3

   名前  年齢 性別 居住地
0  山田  20  男  東京
1  鈴木  34  男  大阪
2  田中  12  男  宮城
3  斎藤  62  女  富山
4  高橋  22  女  大分
5  渡邊  45  男  沖縄

In [33]:
#列の削除→dropメソッド、axis=1
df_4 = df_3.drop('居住地', axis= 1)
df_4
df_4.ix[1]

C:\Users\shuhei\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  after removing the cwd from sys.path.

名前    鈴木
年齢    34
性別     男
Name: 1, dtype: object

In [64]:
df_5.columns = ['name','age','sex']
df_5

  name  age sex
0   山田   20   男
1   鈴木   34   男
2   佐藤   50   女
3   田中   12   男
4   斎藤   62   女
5   高橋   22   女
6   渡邊   45   男

In [65]:
pd.Series([8,13,9,4], index = ['apple', 'orange', 'mango', 'peach'])

apple      8
orange    13
mango      9
peach      4
dtype: int64